sim/mutants/M1-ack-before-sync.patch
# id: M1-ack-before-sync
# covering-test: TestToySurvivesOneThousandSeeds
# package: ./sim/hunt/
# expect: killed
# power-covered-by: floors.go ack-before-sync -- the toy's own flaw classes carry standing floors in sim/hunt/floors.go, measured and enforced there since A0. The raft sweep never runs sim/toy, so a raft-probe number for this class would read zero for a reason that has nothing to do with the claim -- a CONFIRMATION as worthless as a false refutation, and harder to notice because it points the right way. The refutation pass follows the redirection instead: it checks the floor is in floors.go and runs the lane the floors live in
# mutates: the primary acknowledges a write before it is durable
--- a/sim/toy/toy.go
+++ b/sim/toy/toy.go
@@ -636,7 +636,7 @@
 	if p.answered {
 		return
 	}
-	needDurable := n.Flaw != FlawAckBeforeSync
+	needDurable := false
 	needAcks := n.Flaw != FlawAckBeforeReplicate
 
 	if needDurable && !p.durable {
