sim/mutants/M100-verdict-word-ignores-outcome.patch
# id: M100-verdict-word-ignores-outcome
# covering-test: TestAnInconclusiveIsNeitherGreenNorAViolation
# package: ./chaos/
# expect: killed
# power-covered-by: TestAnInconclusiveIsNeitherGreenNorAViolation -- a report-generator defect with a deterministic covering test. GF-62: these three functions are pure Run-to-text, so a kill is a compile-and-run away and a rate floor over seeds would measure nothing a single deterministic case does not.
# power-refutation: not a seeded property. Run.Gate and Run.Report take a constructed Run; there is no schedule to sweep, so the only sound instrument is a table-driven case, which is what the covering test is.
# mutates: an inconclusive is counted as a violation, so A4's three-valued outcome collapses back to the bool it was
--- a/chaos/runner.go
+++ b/chaos/runner.go
@@ -283,7 +283,7 @@
 		case sim.VerdictViolation:
 			bad++
 		case sim.VerdictInconclusive:
-			unsure++
+			bad++
 		}
 	}
 	// EVERY verdict prints, with the number of operations it consumed, and the
