sim/mutants/M12-timeout-as-violation.patch
# id: M12-timeout-as-violation
# covering-test: TestUnavailabilityIsNotAViolation
# package: ./sim/checker/
# expect: killed
# mutates: an operation that never returned is scored as a safety failure rather than unknown
--- a/sim/checker/porcupine.go
+++ b/sim/checker/porcupine.go
@@ -180,7 +180,7 @@
 		ret := int64(e.Return)
 		switch {
 		case e.InFlight() || e.Outcome == sim.RespTimeout:
-			out.unknown = true
+			out.unknown = false
 			// An unreturned operation is open-ended: it may linearize anywhere
 			// after its call.
 			ret = int64(^uint64(0) >> 2)
