sim/mutants/M18-prev-log-check-term-blind.patch
# id: M18-prev-log-check-term-blind
# covering-test: TestLogMatchingOracleReportsNothing
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 5
# power-ceiling: 44
# power-measured: 10 of 300, first at seed 11, under a1 at commit A5-close; was 10 of 300, first at seed 11, at commit 1e2721a+A5-open
# power-config: a1
# mutates: the append consistency check compares the previous INDEX and ignores its term, so a follower splices a leader's suffix onto a prefix that disagrees and two logs share an (index, term) while differing before it
--- a/raft/raft.go
+++ b/raft/raft.go
@@ -1183,7 +1183,7 @@
 	if idx > r.lastIndex() {
 		return false
 	}
-	return r.termAt(idx) == term
+	return true
 }
 
 // logIsUpToDate implements the candidate-log check: a later term wins, and at
