sim/mutants/M21-decode-off-by-one.patch
# id: M21-decode-off-by-one
# covering-test: TestRaftSmoke
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 150
# power-ceiling: 10
# power-measured: 300 of 300, first at seed 0, under current at commit A5-close; was 300 of 300, first at seed 0, at commit 6e716d5+A5-open
# mutates: decodeMessage reads one uint64 more than encodeMessage writes, so no message decodes, no node becomes leader, and every client operation goes unanswered -- the shape of BUG-001, which no safety oracle could see and only the election census caught
--- a/store/codec.go
+++ b/store/codec.go
@@ -201,7 +201,7 @@
 	var m raft.Message
 	m.Type = raft.MessageType(b[0])
 	b = b[1:]
-	var vals [12]uint64
+	var vals [13]uint64
 	for i := range vals {
 		v, rest, ok := takeU64(b)
 		if !ok {
