sim/mutants/M24-answer-by-position.patch
# id: M24-answer-by-position
# covering-test: TestClientHistoryIsLinearizable
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 60
# power-ceiling: 10
# power-measured: 150 of 300, first at seed 1, under current at commit A5-close; was 121 of 300, first at seed 0, at commit 6e716d5+A5-open
# mutates: an applied entry is matched to a client by POSITION in the outstanding list rather than by the proposal's own identifier, so a client is told its write succeeded for a slot somebody else's command occupies -- BUG-004's shape, which all four safety oracles were correctly green through because an entry overwritten by a later leader is legal Raft
--- a/store/node.go
+++ b/store/node.go
@@ -352,8 +352,8 @@
 		return
 	}
 	kept := n.inflight[:0]
-	for _, c := range n.inflight {
-		if c.id != e.ID {
+	for i, c := range n.inflight {
+		if i != 0 {
 			kept = append(kept, c)
 			continue
 		}
