sim/mutants/M26-truncated-suffix-left-in-the-engine.patch
# id: M26-truncated-suffix-left-in-the-engine
# covering-test: TestDurableRecordAgreesWithTheEngine
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 5
# power-ceiling: 10
# power-measured: 16 of 300, first at seed 1, at commit 6e716d5+A5-open; was 11 at commit c1a1f6c+A3
# mutates: a conflicting append rewrites the entries it replaces but leaves the discarded branch's tail in the engine, so recovery reads a new prefix spliced onto a dead branch and calls the result a log -- gapless by index, so Restore accepts it
--- a/store/node.go
+++ b/store/node.go
@@ -409,7 +409,7 @@
 				// for (Amendment A3), and the batch is atomic, so the clear and
 				// the rewrite land together or not at all.
 				if rd.Entries[0].Index <= n.writtenLast {
-					b.DeleteRange(n.logKey(last+1), n.logUpper())
+					_ = n.logUpper()
 					w.clearAbove = last
 				}
 				for _, e := range rd.Entries {
