sim/mutants/M27-durable-record-ignores-a-clear.patch
# id: M27-durable-record-ignores-a-clear
# covering-test: TestDurableRecordAgreesWithTheEngine
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 5
# power-ceiling: 10
# power-measured: 15 of 300, first at seed 1, under current at commit A5-close; was 16 of 300, first at seed 1, at commit 6e716d5+A5-open
# mutates: the driver's durability record keeps entries the engine cleared, so the record the persist-before-reply oracle judges against drifts ahead of what a crash would recover -- the mirror direction of M26, and the direction that would make the oracle wrong rather than the system
--- a/store/node.go
+++ b/store/node.go
@@ -560,7 +560,7 @@
 		}
 		n.durLog = append(n.durLog, e)
 	}
-	if w.clearAbove > 0 {
+	if false {
 		keep := int(w.clearAbove - n.durSnap.Index)
 		if keep >= 0 && keep < len(n.durLog) {
 			n.durLog = n.durLog[:keep]
