sim/mutants/M30-leader-counts-its-own-unsynced-append.patch
# id: M30-leader-counts-its-own-unsynced-append
# covering-test: TestLeaderCountsItsOwnCopyOnlyWhenDurable
# package: ./raft/
# expect: killed
# power-seeds: 300
# power-floor: 1
# power-ceiling: 300
# power-measured: 1 of 300, first at seed 178, under current -- against a clean tree at the SAME 300 seeds reading 0 of 300 with sweepfail=0. The oracle that names it is leader completeness: 'range 1: entry index 187 term 1 was committed (first applied by node 1 at instant 7133514064) but node 1, leading in later term 2 from instant 9201825394, had persisted 0 entries above a snapshot at 186, without it' -- COMMITTED IS FOREVER, broken, which is exactly what this mutation plants. RULED out of the exempt column entirely (DESIGN-A6 section 43.5): a class with a confirmed first-tier safety detection has no business in either exemption. THE PREVIOUS DECLARATION WAS AN OPT-OUT AND IT WAS WRONG: 'unreachable on this schedule mix by construction: every node has the same modelled disk, so the leader's own fsync always lands before any follower's ack. Measured trace-identical over 10k seeds. A floor would be a floor on zero.' That measurement was true when it was taken and went STALE when A5 and A6 reshaped the schedule mix -- A2's kill-time amendment, a schedule mix is a claim about reachability -- and it was then cited a SECOND time, at section 42.1, as the reason not to re-measure the class. FLOOR AND CEILING ARE NOT INDEPENDENT HERE, and saying so is the honest form: at 1 detection in 300 a rate floor of 1 and a ceiling of 300 are the same statement, DETECTED AT ALL, which is floors.go's documented answer for a class too weak to carry a rate ('a floor derived from a single detection would be noise'). So this class has no kill-time signal separate from its rate, and the day it earns one is the day the rate rises. What must not silently change is that the class remains reachable
# mutates: the leader advances its own match index on append instead of on durability, so it counts a copy it has not written toward the commit quorum -- DR-8's first gate with the leader on the other end of it, where the message is elided because the leader is talking to itself
--- a/raft/raft.go
+++ b/raft/raft.go
@@ -546,11 +546,7 @@
 	}
 	e := Entry{Term: r.term, Index: r.lastIndex() + 1, ID: id, Data: append([]byte(nil), data...)}
 	r.appendEntries(e)
-	// The leader's own match index is NOT advanced here. A leader counts its own
-	// replication only once the entry is durable, and AckPersisted is where that
-	// happens; setting it on append would count a copy the leader has not
-	// written, which is the same ack-before-sync this package gates every
-	// outbound message against.
+	r.matchIndex[r.peerIdx(r.id)] = e.Index
 	r.broadcastAppend()
 	return nil
 }
@@ -806,7 +802,7 @@
 		r.nextIndex[i] = last + 1
 		r.matchIndex[i] = 0
 	}
-	r.matchIndex[r.peerIdx(r.id)] = r.tail.persisted
+	r.matchIndex[r.peerIdx(r.id)] = last
 	r.broadcastAppend()
 }
 
