sim/mutants/M31-snapshot-stream-loses-its-gate.patch
# id: M31-snapshot-stream-loses-its-gate
# covering-test: TestPersistBeforeReplyOracleReportsNothing
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 50
# power-ceiling: 10
# power-measured: 171 of 300, first at seed 1, under current at commit A5-close; was 166 of 300, first at seed 1, at commit 1e2721a+A5-open
# mutates: an index covered by an in-flight snapshot install is reported as needing no durability point, so an append response attesting to it goes out while the snapshot is still unwritten. DR-8 enumerated this as MsgAppResp following InstallSnapshot before raft/ existed, and A2 is where it became reachable
--- a/raft/raft.go
+++ b/raft/raft.go
@@ -1598,10 +1598,6 @@
 func (r *Raft) marksFor(idx Index) (logMark, snapMark PersistMark) {
 	if idx == 0 {
 		return 0, 0
-	}
-	if idx <= r.snapIndex {
-		// Covered by the snapshot stream, and by nothing in the log stream.
-		return 0, r.snapMark
 	}
 	if idx <= r.tail.persisted {
 		return 0, 0
