sim/mutants/M32-apply-stream-skips-an-index.patch
# id: M32-apply-stream-skips-an-index
# covering-test: TestApplyContinuityOracleReportsNothing
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 150
# power-ceiling: 10
# power-measured: 300 of 300, first at seed 0, under current at commit A5-close; was 300 of 300, first at seed 0, at commit 6e716d5+A5-open
# mutates: the driver acknowledges one more applied index than it applied, so the state machine never sees that command and the next Ready starts past it -- a hole no cross-node comparison can see, because every node's stream is self-consistent
--- a/store/node.go
+++ b/store/node.go
@@ -886,7 +886,7 @@
 			n.maybeGC()
 			n.cfg.Ledger.RecordApplied(uint64(n.rng), n.cfg.Ordinal, provenance.Witness(rd.Committed), at)
 			n.applied = rd.Committed[len(rd.Committed)-1].Index
-			n.raft.AckApplied(n.applied)
+			n.raft.AckApplied(n.applied + 1)
 			n.maybeSnapshot(at, s)
 			n.maybeSplit(at)
 		}
