sim/mutants/M33-state-machine-drops-a-command.patch
# id: M33-state-machine-drops-a-command
# covering-test: TestSnapshotEquivalenceOracleReportsNothing
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 145
# power-ceiling: 10
# power-measured: 293 of 300, first at seed 0, under current at commit A5-close; was 260 of 300, first at seed 0, at commit 1e2721a+A5-open
# mutates: the state machine silently drops one command in seven, so every snapshot it takes is not the state its own committed log produces. The harness re-implements what a command DOES rather than calling into store, which is the only reason this cannot cancel out on both sides of the comparison
--- a/store/node.go
+++ b/store/node.go
@@ -636,7 +636,7 @@
 						continue
 					}
 					owned = n.desc.Contains([]byte(k))
-					if owned && op == "put" {
+					if owned && op == "put" && e.Index%7 != 0 {
 						if err := n.mvcc.PutInto(mb, []byte(k), cmdTS, []byte(v)); err != nil {
 							// A write the state machine refuses is not a crash:
 							// below the GC mark it is a command the cluster has
