sim/mutants/M37-a-learner-is-counted-in-the-quorum.patch
# id: M37-a-learner-is-counted-in-the-quorum
# covering-test: TestElectionSafetyOracleReportsNothing
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 10
# power-ceiling: 10
# power-measured: 33 of 300, first at seed 0, under current at commit A5-close; was 32 of 300, first at seed 0, at commit 1e2721a+A5-open
# mutates: learners are counted in quorums and votes, so the cluster's idea of a majority includes nodes that were added precisely because they could not yet be trusted with one
--- a/raft/raft.go
+++ b/raft/raft.go
@@ -2477,7 +2477,8 @@
 func (r *Raft) countVoters(flags []bool) int {
 	n := 0
 	for i, p := range r.peers {
-		if i < len(flags) && flags[i] && r.conf.IsVoter(p) {
+		if i < len(flags) && flags[i] {
+			_ = p
 			n++
 		}
 	}
