sim/mutants/M39-snapshot-drops-the-configuration.patch
# id: M39-snapshot-drops-the-configuration
# covering-test: TestConfigurationSurvivesRecovery
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 48
# power-ceiling: 10
# power-measured: 271 of 300, first at seed 0, under current at commit A5-close; was 254 of 300, first at seed 0, at commit 1e2721a+A5-open
# mutates: a snapshot is written without its configuration, so a node recovering from it has no idea who it is talking to and falls back to the membership it was first constructed with
--- a/store/node.go
+++ b/store/node.go
@@ -979,7 +979,8 @@
 		// threshold will be met again on the next apply.
 		return
 	}
-	meta := raft.SnapshotMeta{Index: applied, Term: term, Conf: conf}
+	_ = conf
+	meta := raft.SnapshotMeta{Index: applied, Term: term}
 	data := encodeMachine(n.desc, n.mvcc.GCMark(), n.versions())
 
 	b := engine.NewBatch()
