sim/mutants/M47-superseded-split-applied-anyway.patch
# id: M47-superseded-split-applied-anyway
# covering-test: TestASupersededSplitIsRefused
# package: ./store/
# expect: killed
# power-unreachable: census identity, 300 seeds, 76 fields -- the sweep cannot produce this schedule. Raft's figure-8 rule serialises it: a new leader must commit an entry of its own before it can commit the previous term's split, and committing it means applying it, which moves the extent before a second split can be proposed from it. Zero firings in 300 A4 seeds, recorded in DESIGN-A4 section 10 as an unexercised path rather than as evidence. The guard is induced directly instead, which is what a floor could not have told us. RE-MEASURED under current at A6's close with the repaired probe, and UPGRADED: 0 of 300 per-seed, sweepfail=0, and the accumulated census is BYTE-IDENTICAL to the unmutated tree's across all four shards -- 0 of 76 fields move. That is a stronger claim than the old 'zero firings', which was a detection claim and therefore compatible with the defect happening unnoticed, as M62 turned out to be. Same disposition and same instrument as M66 and M30: UNREACHED and proved (DESIGN-A6 section 42). NO OTHER DETECTOR: census identity is the strongest instrument this harness has -- if no field the harness counts moves, there is nothing for any detector to see, and a rate or a sweep verdict is a strictly weaker view of the same run. Re-asked by the refutation pass at 30 seeds and still byte-identical, which re-asks the claim rather than restating it
# power-refute-claim: census-identical
# mutates: the extent guard requires ALL THREE mismatches instead of any one, so a split superseded by an earlier one is applied anyway. A split superseded by an earlier one then moves the left range's End BACKWARDS past the first cut and mints a range overlapping the one already there, so two ranges claim the same keys and their replicas disagree about which entry is at index one of a range born twice
--- a/store/machine.go
+++ b/store/machine.go
@@ -517,8 +517,8 @@
 	//
 	// Found by state machine safety on the first A4 sweep: two nodes applying
 	// different commands at index 1 of a range born from a split.
-	if spec.Left.Epoch != left.desc.Epoch+1 ||
-		!bytes.Equal(spec.Left.Start, left.desc.Start) ||
+	if spec.Left.Epoch != left.desc.Epoch+1 &&
+		!bytes.Equal(spec.Left.Start, left.desc.Start) &&
 		!bytes.Equal(spec.Right.End, left.desc.End) {
 		left.staleSplits++
 		return
