sim/mutants/M53-empty-mark-releases-through.patch
# id: M53-empty-mark-releases-through
# covering-test: TestAnEmptyMarkDoesNotReleaseAnEarlierOne
# package: ./raft/
# expect: killed
# power: n/a -- unreachable in the schedule mix the sweep runs, by argument and by measurement. The defect needs a mark opened and then emptied while an earlier gated message waits, which A5's UNTHROTTLED collector produced constantly: 1 detection in 60 seeds. Throttling the collector to one collection in flight -- a 30x runtime win that made a 10,000-seed exit run viable -- took it to 0 in 300 and then 0 in 3000. That is A2's M34 lesson from the other side: a schedule mix is a claim about reachability, and this change traded some. Killed by TestAnEmptyMarkDoesNotReleaseAnEarlierOne, which builds the sequence by hand. RE-MEASURED under current at A6's close with the repaired probe: 0 of 300 per-seed AND sweepfail=0, against a clean baseline of 0 and sweepfail=0 at the same 300 seeds. The opt-out stands. It is NOT M66's or M47's byte-identical unreached, though: 34 census fields drift, so the mutated line runs and the schedule diverges -- what does not occur is the condition the defect needs (DESIGN-A6 section 42)
# mutates: a mark that covers nothing releases everything THROUGH it instead of only itself. An empty mark is satisfied because there is nothing to wait for, which is a statement about that mark alone -- it has not earned the monotonicity a durability acknowledgement has. Releasing through it frees messages gated on an earlier mark whose write is still in flight, so a follower advertises a term that is not on its disk (BUG-017)
--- a/raft/raft.go
+++ b/raft/raft.go
@@ -2065,7 +2065,7 @@
 		// AssertQuiescent is what turned this from a silent stall into a
 		// failure.
 		if rd.Mark != 0 && !r.markHandedOff {
-			r.closeEmptyMark(rd.Mark)
+			r.releaseThrough(rd.Mark)
 		}
 		// A Ready that hands nothing over names no durability point, even while
 		// an earlier mark is still in flight. Reporting one the driver cannot
