sim/mutants/M61-rollback-leaves-the-version.patch
# id: M61-rollback-leaves-the-version
# covering-test: TestPercolatorInvariantsReportNothing
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 100
# power-ceiling: 10
# power-measured: 232 of 300, first at seed 0, under current at A6's close. This is the class that produced percolator-invariants #5 by surviving its first run, and the rate is what a structural invariant over the final state buys over a checker that compares replicas
# mutates: a rollback drops the lock and writes the tombstone but leaves the uncommitted data version behind. SYMMETRIC across replicas, so replay equivalence runs the same apply path and leaves the same version -- and no client can see it either, because no commit record points at it. It SURVIVED its first covering test, which is the surrendered property made visible, and the invariant that catches it was added in response: a rolled-back version does not exist
--- a/kv/txn.go
+++ b/kv/txn.go
@@ -155,10 +155,9 @@
 	b.Set(WriteKey(s.ns, key, startTS), encodeWrite(startTS, true))
 	if err := s.releaseLockOf(b, key, startTS); err != nil {
 		return err
 	}
 	// The VERSION delete is already keyed by the start timestamp, so it can
 	// never touch another transaction's write. Only the lock was ambiguous.
-	b.Delete(EncodeKey(s.ns, key, startTS))
 	s.rollbacks++
 	return nil
 }
