sim/mutants/M65-rollback-takes-any-lock.patch
# id: M65-rollback-takes-any-lock
# covering-test: TestRaftExitCriteria
# package: ./sim/hunt/
# expect: killed
# power-seeds: 300
# power-floor: 1
# power-ceiling: 60
# power-measured: PENDING
# mutates: BUG-019 exactly. A rollback deletes the key's lock without checking whose it is, so a transaction that was refused and is cleaning up after itself takes a live transaction's lock. The victim becomes a committed transaction with an orphaned version: no lock, so no reader ever discovers it and no resolver ever finishes it, and the value it committed is invisible forever. Caught by bank-conservation and by nothing else -- the state it produces is internally consistent, it just has the wrong amount of money in it
--- a/kv/txn.go
+++ b/kv/txn.go
@@ -152,9 +152,7 @@
 		return ErrUnsetTimestamp
 	}
 	b.Set(WriteKey(s.ns, key, startTS), encodeWrite(startTS, true))
-	if err := s.releaseLockOf(b, key, startTS); err != nil {
-		return err
-	}
+	b.Delete(LockKey(s.ns, key))
 	// The VERSION delete is already keyed by the start timestamp, so it can
 	// never touch another transaction's write. Only the lock was ambiguous.
 	b.Delete(EncodeKey(s.ns, key, startTS))
