sim/mutants/M66-commit-takes-any-lock.patch
# id: M66-commit-takes-any-lock
# covering-test: TestALateCommitDoesNotOrphanTheNextTransactionsVersion
# package: ./kv/
# expect: killed
# power-unreachable: census identity, 40 seeds, ForeignLocksKept included -- UNREACHED rather than undetected, and measured as such. Applied to the tree it changes NOTHING the harness counts: 40 seeds, every census field byte-identical to the unmutated run, ForeignLocksKept included. That counter increments exactly when a commit or a rollback finds somebody else's lock and this mutant removes the check from the COMMIT path only, so an identical count says CommitInto never once met a foreign lock across 40 seeds. Same disposition as M47 and the envelope refusal: prove the mix cannot produce the condition, then build the lane that does. TestALateCommitDoesNotOrphanTheNextTransactionsVersion is that lane. NO OTHER DETECTOR: as M47 -- census identity dominates every per-seed and per-sweep detector, because a detector can only speak about something the harness counted. Re-asked by the refutation pass at 30 seeds and still byte-identical
# power-refute-claim: census-identical
# mutates: BUG-019 on the roll-FORWARD path, which is worse than the rollback one: a commit can be issued by a RESOLVER acting on somebody else's behalf, so the lock it steals belongs to a transaction that is not even a party to the operation. Same consequence -- an orphaned committed version -- and the same single detector
--- a/kv/txn.go
+++ b/kv/txn.go
@@ -200,7 +200,7 @@
 			"before it began, and a reader would see the write appear in its own past", commitTS, startTS)
 	}
 	b.Set(WriteKey(s.ns, key, commitTS), encodeWrite(startTS, false))
-	if err := s.releaseLockOf(b, key, startTS); err != nil {
+	if err := s.releaseAnyLock(b, key); err != nil {
 		return err
 	}
 	s.commits++
@@ -540,4 +540,12 @@
 	}
 	key, _, ok := takeMetaKey(ns, kind, engineKey)
 	return key, ok
+}
+
+// releaseAnyLock is the pre-BUG-019 reading of "delete the lock": it deletes the
+// SLOT, whoever owns it. It exists only so a mutant can put one path back to it
+// without touching the other, which is what keeps M65 and M66 two classes.
+func (s *Store) releaseAnyLock(b *engine.Batch, key []byte) error {
+	b.Delete(LockKey(s.ns, key))
+	return nil
 }
