sim/mutants/M67-minting-drops-the-node-tag.patch
# id: M67-minting-drops-the-node-tag
# covering-test: TestTwoNodesNeverMintTheSameTimestamp
# package: ./hlc/
# expect: killed
# power: n/a -- measured twice and both times zero, and the reason is the class rather than the instrument. As a RATE: 0 of 1 and then 0 of 60 with the sweep detector on. Its sweep-level detector is IdentityCollisions, which fired 38 times in 25,000 seeds before the fix -- about 1 in 660 -- so a floor honest enough to assert would need a sweep of thousands, roughly five hours for one class. It is killed deterministically by TestTwoNodesNeverMintTheSameTimestamp, a unit test in ./hlc/ where two clocks over one physical clock collide within a handful of calls. A unit test is the correct instrument for a class this rare in a sweep, and saying '1 of 1' was a sweep expectation the probe could never satisfy
# mutates: BUG-021's first half. The logical counter restarts at zero instead of at this node's slot, so two nodes over clocks a hold has pulled together mint the same (wall, logical). A transaction's start timestamp addresses the lock and the data version of every key it touches, so two transactions then share them: one commits, one is rolled back, and the version belongs to both
--- a/hlc/hlc.go
+++ b/hlc/hlc.go
@@ -242,7 +242,7 @@
 	phys := Timestamp{Wall: c.phys.Wall()}
 	if c.last.Wall < phys.Wall {
 		// The physical clock has moved past everything this clock has issued, so
 		// the counter restarts -- at this node's slot, not at zero.
-		c.last = Timestamp{Wall: phys.Wall, Logical: c.id}
+		c.last = Timestamp{Wall: phys.Wall, Logical: 0}
 		return c.last
 	}
 	c.physRegressions++
