sim/mutants/M68-restart-timestamp-derived-not-minted.patch
# id: M68-restart-timestamp-derived-not-minted
# covering-test: TestRestartsMintTheirOwnStartTimestamp
# package: ./sim/hunt/
# expect: killed
# power-seeds: 1
# power-floor: 1
# power-ceiling: 1
# power-measured: 7 foreign tags across 10 uncertainty restarts over 12 seeds, against 0 of 10 on the clean tree. It SURVIVED twice before this: pinned first to seed 90004, which is the schedule that found BUG-021 and does not restart; then to a counter living inside nowAbove, which this patch deletes the call to -- so the mutation removed the guard along with the behaviour. DESIGN-A6 sections 22.6 and 22.7
# mutates: BUG-021's SECOND half, and the reason the fix is one decision rather than two. A restarting transaction adopts RestartAt directly instead of minting above it. RestartAt is the observed commit's successor -- Logical plus one -- and Logical's low bits are the node tag, so the restarted transaction is identified by a number from another node's sequence. A tree carrying only the first half of the fix looks complete until a restart lands on a foreign tag
--- a/sim/hunt/bank.go
+++ b/sim/hunt/bank.go
@@ -439,7 +439,7 @@
 	// the half of option A that is easy to leave out, because a partial
 	// implementation looks exactly like a complete one until a restart lands on a
 	// foreign tag.
-	minted, node, ok := c.nowAboveFrom(t.ts, ts)
+	minted, node, ok := ts, t.ts%len(c.drivers), true
 	if !ok {
 		c.abandon(t)
 		return
