sim/mutants/M76-read-answered-on-the-quorum-alone.patch
# id: M76-read-answered-on-the-quorum-alone
# expect: killed
# covering-test: TestAReadIsNotAnsweredBeforeItsOwnApply
# package: ./store/
# power-covered-by: TestAReadIsNotAnsweredBeforeItsOwnApply -- a DIRECTED test that sets a confirmed index ABOVE this replica's applied index, which is the whole precondition. The sweep measured this class at 1 of 30 and only on the FOLLOWER path, because on a leader the drain loop applies before it serves and the wait is held redundant; the directed test makes the gap by hand and does not depend on which role the schedule produced
# power-refutation: this class named TestRaftExitCriteria, a 10,000-seed sweep costing 19 hours per invocation at the exit run's measured 6.9 s/seed. Seven mutants named it, so make mutants -- which is in the ci target -- asked for six days for that one covering test, and its baseline timed out and reported INVALID. A covering test built on a sweep stops covering when the workload moves and does it silently; this one is directed and cannot
# mutates: a read is answered as soon as its leadership quorum confirms, WITHOUT waiting for this replica's own applied index to reach the confirmed read index. That is section 1.1's SECOND condition dropped, and it is the half that gets forgotten because the hard-looking half -- talking to a quorum -- is already done. The quorum establishes a POSITION: that this leader was still leader at or after the read arrived, so nothing a newer leader committed can be missed below that index. It says nothing whatever about whether THIS node's state machine has got there yet, and answering before it has is reading your own past. Ansh, ruling on the differential oracle: 'plant it -- a mutant that answers on the quorum alone, killed by the differential oracle, since a client-visible stale read is precisely what ruling 5's fixture exists to catch'. read-index-answers-match-the-log is that fixture: it replays the range's committed prefix to the confirmed index and compares, so it sees a stale answer whether or not any client observed the write that was missed -- which per-key linearizability cannot
--- a/store/node.go
+++ b/store/node.go
@@ -906,7 +906,7 @@
 func (n *Replica) serveReadyReads(at clock.Instant, s sim.Scheduler) {
 	kept := n.pendingReads[:0]
 	for _, q := range n.pendingReads {
-		if q.index == 0 || n.applied < q.index {
+		if q.index == 0 {
 			kept = append(kept, q)
 			continue
 		}
