sim/mutants/M79-read-index-answers-at-a-clock-reading.patch
# id: M79-read-index-answers-at-a-clock-reading
# expect: killed
# covering-test: TestAPlainReadIsAnsweredAtTheLatestVersion
# package: ./store/
# power-covered-by: TestAPlainReadIsAnsweredAtTheLatestVersion -- a DIRECTED test. It stamps the newer version ABOVE the serving replica's own clock, which is what skew inside maxOffset produces between the leader that stamped a write and the follower answering a read, and derives that timestamp FROM the clock rather than picking a constant -- the first attempt picked one that sat below it and the test's own vacuity guard refused to run
# power-refutation: this class named TestRaftExitCriteria when it was declared -- a 10,000-seed sweep, 19 hours per invocation at the exit run's measured 6.9 s/seed. Seven mutants named it, so make mutants asked for six days of machine time for that covering test alone, and make mutants is in the ci target. Declaring a sweep as a covering test is the disease this phase diagnosed twice and then reproduced four times while writing the general form
# mutates: a plain read served by read index is answered at a TIMESTAMP taken from the serving replica's own clock WHEN THE REQUEST ARRIVED, rather than at the latest version. This is BUG-028, the second member of the read-is-a-log-entry class, and the one that makes the class worth enumerating: the argument that let a plain read leave the log is D-A7-5's sentence 'a PLAIN read has no timestamp to protect', and the implementation gave it one anyway. ReadAt returns the newest version AT OR BEFORE ts, so under skew inside maxOffset a follower's clock sits below the leader's and a write the leader stamped above that follower's clock is invisible -- however far past the confirmed index the follower has applied. Read index's whole claim is that it is correct WITHOUT trusting clocks; answering at a clock reading puts the clock back in. THE ARRIVAL TIME IS LOAD-BEARING: a first attempt planted the clock read at ANSWER time instead, one line and three hunks smaller, and measured 0 of 400 -- because by the time a read is answered the serving replica has absorbed the leader's clock through the messages that carried the confirmed index. A mutant that plants 'the same defect' one step later in the timeline plants a different and weaker defect. THE GENERAL FORM: a mutant is a claim about WHERE A DEFECT LIVES, and a zero can mean the claim is aimed at the wrong point in the TIMELINE rather than at the wrong line. There are FOUR axes and no lane asks more than one: the LINE (Track B's BM55 -- a patch aimed at a line a comment claimed was load-bearing and was not), CODE POSITION (make mutant-covered, the only mechanised one), ROLE (M80), and TIME (this one). DESIGN-A7 section 5e.2b. Killed by read-index-answers-match-the-log, whose model reads the LATEST version for an off-log answer for exactly this reason; per-key linearizability catches it only when some client observed the write that was missed
--- a/store/node.go
+++ b/store/node.go
@@ -394,6 +394,8 @@
 	ctx     []byte
 	histIdx int
 	key     string
+
+	at hlc.Timestamp
 
 	// anyReplica is what the CLIENT asked for, kept so a reroute reissues the
 	// same question. Dropping it would silently turn a follower read into a
@@ -548,7 +550,7 @@
 			return
 		}
 		n.pendingReads = append(n.pendingReads, pendingRead{
-			ctx: ctx, histIdx: req.HistIdx, key: req.Key, anyReplica: req.AnyReplica,
+			ctx: ctx, histIdx: req.HistIdx, key: req.Key, at: at, anyReplica: req.AnyReplica,
 			viaFollower: n.raft.Role() != raft.RoleLeader,
 		})
 		return
@@ -1001,7 +1003,7 @@
 		//
 		// Read index's whole claim is that it is correct WITHOUT trusting
 		// clocks. Answering at a clock reading put the clock back in.
-		v, ok, err := n.mvcc.ReadLatest([]byte(q.key))
+		v, ok, err := n.mvcc.ReadAt([]byte(q.key), q.at)
 		// Recorded for `read-index-answers-match-the-log`, with OffLog set and
 		// Index the CONFIRMED read index rather than an entry's position --
 		// there is no entry. That oracle is the only instrument that can catch a
