sim/mutants/M80-a-new-message-type-joins-the-allow-list.patch
# id: M80-a-new-message-type-joins-the-allow-list
# covering-test: TestRaftExitCriteria
# package: ./sim/hunt/
# expect: killed
# power-seeds: 400
# power-floor: 1
# power-ceiling: 200
# power-measured: 3 of 400, first at seed 99, under CURRENT (A7's shape) -- and seed 99 is one of the three seeds BUG-027 was actually observed on in the wild, which is as direct a corroboration as a floor gets. A floor of 1 in 400 is FRAGILE and is stated as such: the class is rare because it needs a follower forwarding a read inside the window between its own term bump and that term reaching disk. The earlier RESPONSE-only version measured 0 of 400, and that zero is a finding rather than a miss -- a leader's term is necessarily durable, so the response half is belt-and-braces and the request half is load-bearing. Same general form as M79's first version and a different axis: a mutant is a claim about where a defect lives, and a zero can mean the claim is aimed at the wrong ROLE -- leader rather than follower -- rather than at the wrong line
# mutates: BOTH read-index message types are added to send()'s allow-list and both call sites reverted to a plain send, so each leaves its node advertising a term that may not be durable. This is BUG-027 restored exactly -- but it is planted at the ALLOW-LIST rather than only at the call sites on purpose, because the structural fix changes what the human error looks like. Before the fix the error was forgetting to gate; after it, the only way in is adding a type to an enumerated list next to a comment saying the argument is the part that matters. So the mutant is the shape of the next occurrence. IT MUST INCLUDE THE REQUEST SIDE: a first attempt planted only MsgReadIndexResp and measured 0 of 400, and the reason is a finding rather than a miss -- the RESPONSE is sent by a leader, and a leader's term is necessarily durable (it could not have won its election otherwise), which is the same gated-by-consequence argument MsgTimeoutNow rests on. The reachable half is the REQUEST, forwarded by a FOLLOWER whose term bump may still be in flight, and all three violations observed in the wild say 'sent a read-index', not 'read-index-resp'. Killed by persist-before-reply, which holds every type but the two pre-vote types to Term <= durableTerm
--- a/raft/raft.go
+++ b/raft/raft.go
@@ -1784,9 +1784,7 @@
 		if r.leader == 0 {
 			return ErrNotLeader
 		}
-		// GATE: the forward advertises this follower's term, so it is a
-		// response-after-a-term-bump in all but name (BUG-027).
-		r.sendGated(Message{Type: MsgReadIndex, From: r.id, To: r.leader, Term: r.term,
+		r.send(Message{Type: MsgReadIndex, From: r.id, To: r.leader, Term: r.term,
 			ReadCtx: append([]byte(nil), ctx...)})
 		return nil
 	default:
@@ -1853,9 +1851,7 @@
 			r.readyReads = append(r.readyReads, ReadState{Index: q.index, Ctx: q.ctx})
 			continue
 		}
-		// GATE: the quorum makes the INDEX safe and never made the TERM safe.
-		// The reply carries both (BUG-027).
-		r.sendGated(Message{Type: MsgReadIndexResp, From: r.id, To: q.from, Term: r.term,
+		r.send(Message{Type: MsgReadIndexResp, From: r.id, To: q.from, Term: r.term,
 			ReadCtx: q.ctx, ReadIndex: q.index})
 	}
 	r.pendingReads = kept
@@ -2750,7 +2746,7 @@
 // each other by tools/gatepin.
 func (r *Raft) send(m Message) {
 	switch m.Type {
-	case MsgPreVote, MsgPreVoteResp, MsgTimeoutNow:
+	case MsgPreVote, MsgPreVoteResp, MsgTimeoutNow, MsgReadIndex, MsgReadIndexResp:
 	default:
 		panic(fmt.Sprintf("raft: node %d released a %s through send(), which withholds nothing. "+
 			"Every message that leaves this node carries r.term and makes a claim about it; only "+
